content/posts/Embodying_probabilistic_inference_in_biochemical_circuits_by_Yarden_Katz,_Michael_Springer,_and_Walter_Fontana_in_2018.md
+++
title = "Embodying probabilistic inference in biochemical circuits by Yarden Katz, Michael Springer, and Walter Fontana in 2018"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:20-04:00
slug = "Embodying_probabilistic_inference_in_biochemical_circuits_by_Yarden_Katz,_Michael_Springer,_and_Walter_Fontana_in_2018"
draft = false
+++

## Introduction {#introduction}


## Analysis {#analysis}


### Real-time probabilistic inference in a changing environment {#real-time-probabilistic-inference-in-a-changing-environment}


### Representing a changing environment using sensors, recorders and integrators {#representing-a-changing-environment-using-sensors-recorders-and-integrators}


### Programmatic generation of a biochemical circuit that performs inference {#programmatic-generation-of-a-biochemical-circuit-that-performs-inference}


### Embodied inference is constrained by the logic of protein production {#embodied-inference-is-constrained-by-the-logic-of-protein-production}

<!--list-separator-->

-  Properties of an inferential mechanism

<!--list-separator-->

-  Coupling of inference and action

<!--list-separator-->

-  Constraints of embodiment by proteins

<!--list-separator-->

-  Variation in coupling inference to action

<!--list-separator-->

-  Relationship to idealized inference


### Circuit failure modes {#circuit-failure-modes}


### Searching for the molecular correlates of inference {#searching-for-the-molecular-correlates-of-inference}


## Discussion {#discussion}


## [references]({{< relref "references" >}}) {#references--references-dot-md}


### Mellis, I. A., & Raj, A. (2015). Half dozen of one, six billion of the other: What can small\* and large-scale molecular systems biology learn from one another? <span class="underline"><span class="underline">Genome Research</span></span>, \_\_25\_\_(10), 1466–1472. <https://doi.org/10.1101/gr.190579.115> {#mellis-i-dot-a-dot-and-raj-a-dot--2015--dot-half-dozen-of-one-six-billion-of-the-other-what-can-small-and-large-scale-molecular-systems-biology-learn-from-one-another-25--10--1466-1472-dot-https-doi-dot-org-10-dot-1101-gr-dot-190579-dot-115}


### Thompson, A. (1997). An evolved circuit, intrinsic in silicon, entwined with physics. In <span class="underline"><span class="underline">Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)</span></span> (Vol. 1259, pp. 390–405). <https://doi.org/10.1007/3-540-63173-9%5F61> {#thompson-a-dot--1997--dot-an-evolved-circuit-intrinsic-in-silicon-entwined-with-physics-dot-in--vol-dot-1259-pp-dot-390-405--dot-https-doi-dot-org-10-dot-1007-3-540-63173-9-61}


### Lazebnik, Y. (2002). Can a biologist fix a radio?—Or, what I learned while studying apoptosis. <span class="underline"><span class="underline">Cancer Cell</span></span>, \_\_2\_\_(3), 179–182. <https://doi.org/10.1016/S1535-6108(02)>00133-2 {#lazebnik-y-dot--2002--dot-can-a-biologist-fix-a-radio-or-what-i-learned-while-studying-apoptosis-dot-2--3--179-182-dot-https-doi-dot-org-10-dot-1016-s1535-6108--02--00133-2}
